'use strict'

// ЗАДАЧА 1
//Объявите две переменные: admin и name.
let admin;
let name;
//Запишите строку "Джон" в переменную name.
name = 'Джон';
//Скопируйте значение из переменной name в admin.
admin = name;
//Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).
alert(admin);


// ЗАДАЧА 2 
//Создайте переменную для названия нашей планеты. Как бы вы её назвали?
let ourPlanet;
let ourPlanetName;  
//Создайте переменную для хранения имени текущего посетителя сайта. 
//Как бы вы назвали такую переменную?
let currentUser;
let currentUserName;

// ЗАДАЧА 3

//const birthday = '18.04.1982';

//const age = someCode(birthday);
// У нас есть константа birthday, а также age, 
// которая вычисляется при помощи некоторого кода, 
// используя значение из birthday 

//Можно ли использовать заглавные буквы

const BIRTHDAY = '18.04.1982'; // нельзя, т.к. у разного пользователя разное др и это не всегда одно и то же, как цвет например

const AGE = someCode(BIRTHDAY); // age нельзя т.к. она будет вычисляться на основе разных birthday и будет разная для разных пользователей


